Tecnologia/26313276.md

Suport Tècnic : ETAULER - FLUX DEL SERVEI - Descarregar diligència  

1.  [Suport Tècnic](index.html)
2.  [Suport Tècnic](13893782.html)
3.  [02 - FAQ's serveis](26313393.html)
4.  [FAQ's eTAULER](28705565.html)

Suport Tècnic : ETAULER - FLUX DEL SERVEI - Descarregar diligència
==================================================================

Created by Unknown User (obernalp), last modified by Unknown User (otecjcolomer) on 23 May 2022

Per descarregar una diligència ho podem fer de diverses formes:

A través de l'EACAT
===================

A través de l'EACAT, impersonant-nos i descarregant la diligència de l'edicte retirat.

Haurem d'impersonar-nos a l'EACAT com a l'usuari de l'edicte: Global - Impersonar-se EACAT

Després accedirem al servei de l'e-TAULER:

![](attachments/26313276/26316251.png)

A continuació accedirem a l'edicte que ens interessi (haurà d'estar retirat):

![](attachments/26313276/26316245.png)

  

Finalment descarregarem la diligència i veurem com es descarrega al navegador:

![](attachments/26313276/26316246.png)

  

A través de SoapUI
==================

A través de SoapUI, fent una petició de descàrrega:

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://www.openuri.org/" xmlns:pet="http://gencat.net/scsp/esquemes/peticion">
   <soapenv:Header/>
   <soapenv:Body>
      <open:procesa>
         <ns1:Peticion xmlns:ns1="http://gencat.net/scsp/esquemes/peticion">
            <ns1:Atributos>
               <ns1:IdPeticion>9821920002-DESC-${=(long)(System.currentTimeMillis())}</ns1:IdPeticion>
               <ns1:NumElementos>1</ns1:NumElementos>
               <ns1:TimeStamp/>
               <ns1:CodigoCertificado>ETAULER</ns1:CodigoCertificado>
               <ns1:CodigoProducto>ETAULER</ns1:CodigoProducto>
               <ns1:DatosAutorizacion>
                  <ns1:IdentificadorSolicitante>9821920002</ns1:IdentificadorSolicitante>
                  <ns1:NombreSolicitante>Consorci AOC</ns1:NombreSolicitante>
                  <ns1:Finalidad>PROVES</ns1:Finalidad>
               </ns1:DatosAutorizacion>
               <ns1:Emisor>
                  <ns1:NifEmisor>Q0801175A</ns1:NifEmisor>
                  <ns1:NombreEmisor>Consorci AOC</ns1:NombreEmisor>
               </ns1:Emisor>
               <ns1:Funcionario>
                  <ns1:NombreCompletoFuncionario>NOMBRE APELLIDOS</ns1:NombreCompletoFuncionario>
                  <ns1:NifFuncionario>21777952B</ns1:NifFuncionario>
               </ns1:Funcionario>
            </ns1:Atributos>
            <ns1:Solicitudes>
               <ns1:SolicitudTransmision>
                  <ns1:DatosGenericos>
                     <ns1:Emisor>
                        <ns1:NifEmisor>Q0801175A</ns1:NifEmisor>
                        <ns1:NombreEmisor>Consorci AOC</ns1:NombreEmisor>
                     </ns1:Emisor>
                     <ns1:Solicitante>
                        <ns1:IdentificadorSolicitante>9821920002</ns1:IdentificadorSolicitante>
                        <ns1:NombreSolicitante>Consorci AOC</ns1:NombreSolicitante>
                        <ns1:Finalidad>PROVES</ns1:Finalidad>
                        <ns1:Consentimiento>Si</ns1:Consentimiento>
                        <ns1:Funcionario>
                           <ns1:NombreCompletoFuncionario>NOMBRE APELLIDOS</ns1:NombreCompletoFuncionario>
                           <ns1:NifFuncionario>21777952B</ns1:NifFuncionario>
                        </ns1:Funcionario>
                     </ns1:Solicitante>
                     <ns1:Titular>
                        <ns1:TipoDocumentacion>NIF</ns1:TipoDocumentacion>
                        <ns1:Documentacion/>
                     </ns1:Titular>
                     <ns1:Transmision>
                        <ns1:CodigoCertificado>ETAULER</ns1:CodigoCertificado>
                        <ns1:IdSolicitud>1</ns1:IdSolicitud>
                        <ns1:IdTransmision>247668</ns1:IdTransmision>
                     </ns1:Transmision>
                  </ns1:DatosGenericos>
                  <ns1:DatosEspecificos>
                     <eta:peticioConsultarDocumentEdicte xmlns:eta="http://www.aoc.cat/etauler" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                        <eta:idEdicte>PCI30-1537512737133</eta:idEdicte>
                        <eta:diligencia>
                           <eta:idioma>ca</eta:idioma>
                           <eta:format>electronica</eta:format>
                        </eta:diligencia>
                     </eta:peticioConsultarDocumentEdicte>
                  </ns1:DatosEspecificos>
               </ns1:SolicitudTransmision>
            </ns1:Solicitudes>
         </ns1:Peticion>
      </open:procesa>
   </soapenv:Body>
</soapenv:Envelope>

A la resposta obtindrem un PDF codificat en base64:

![](attachments/26313276/26316255.png)

Haurem de copiar la resposta que s'informa al tag diligencia en el notpad++ i decodificar-lo:

![](attachments/26313276/26316249.png)

Finalment haurem de guardar l'arxiu com a .pdf i ja el podrem obrir i llegir

A través de la Base de Dades
============================

Descarregar el PDF i decodificar-lo amb el HASH.

select \* from etauler3pci.et\_document where id\_edicte = 88196

Attachments:
------------

![](images/icons/bullet_blue.gif) [image2019-1-3\_16-22-34.png](attachments/26313276/26316255.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2019-1-3\_16-25-36.png](attachments/26313276/26316249.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2019-1-3\_16-29-16.png](attachments/26313276/26316251.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2019-1-3\_16-30-26.png](attachments/26313276/26316245.png) (image/png)  
![](images/icons/bullet_blue.gif) [image2019-1-3\_16-31-28.png](attachments/26313276/26316246.png) (image/png)  

Document generated by Confluence on 02 June 2025 10:54

[Atlassian](http://www.atlassian.com/)